Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic
The Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic class is the abstract base class for any graphic
which can be drawn directly to a view.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic.MaxPointsCount
The maximum amount of points.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic.identifier
The identifier assigned to the graphic.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic.#ctor(Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic class.
color: The color of the graphic.
isSnappable: A value indicating whether the graphic can be snapped to.
drawLightingEffect: A value indicating whether the graphic has the light effect.
useSecondaryColor: A value indicating whether to use the secondary color.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic.#ctor(Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic class.
color: The color of the graphic.
isSnappable: A value indicating whether the graphic can be snapped to.
drawLightingEffect: A value indicating whether the graphic has the light effect.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic.#ctor(Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic class.
color: The color of the graphic.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic.Color
Gets the color of the Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic.Drawn
Gets a value indicating whether the graphic has been drawn at least once already.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic.Identifier
Gets the identifier.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic.IsSnappable
Gets a value indicating whether the graphic can be snapped to.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic.DrawLightingEffect
Gets a value indicating whether the graphic has the lighting effect.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic.UseSecondaryColor
Gets a value indicating whether the graphic uses the secondary color.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic.DrawTo(Tekla.BIM.DirectManipulation.Services.Graphics.IGraphicsViewInfo)
Draws the Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic to the given view.
The graphic cannot be drawn more than once.
view: The Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo describing the view to draw to.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic.Remove
Removes the graphic from the view.
The graphic cannot be redrawn after removal; Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic.Drawn remains true.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic.Draw(System.Int32,Tekla.BIM.DirectManipulation.Services.Graphics.IGraphicsViewInfo)
Draws the graphic.
identifier: The identifier to use when drawing the graphic.
view: The Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo describing the view to draw to.